import random
guesses_made = 0

print("Вітаю вас в моєму розважальному чат боті!")
print("Хочу трішки знати про тебе")
name = ("Введіть ваше ім'я")
print("Привіт", name)
age = int(input("Введіть свій вік"))
meny = int(input("""Виберіть цифру що вас цікавить
1. Фільми
2. Музика
3. Ігри
0. Вийти з чат боту"""))

film = {"Комедія": "Джентльмени, Аферистка, Щаслива пора", "Фантастика": "Аватар, Ходячий замок, Людина павук",
        "Жахи": "Воно, 30 Днів ночі, Пустота", "Бойовик": "Червоне поввідомлення, Людина з торонто, Чорна вдова",
        "Мелодрами": "Після, Після весілля, У полоні стихії", "Детектив": "Нічний портьє, Волдо, Ремінісценція"}
while meny != 0:
    if meny == 1:
        film_genre = int(input("""Оберіть цифру із жанром
        1. Комедія ...
        2. Фантастика ...
        3. Жахи ...
        4. Бойовик ...
        5. Мелодрами ...
        6. Детектив
        0. Вийтив попереднє меню"""))